DoiServer/app/views/dois/search.html.erb

        					<td><%= doi.description %></td>
						<td><%= link_to(doi.urls.last.url,doi.urls.last.url, url_options = {:confirm => 'You are leaving DOI server. Continue?'}) %></td>
---
SELECT "urls".* FROM "urls" WHERE "urls"."doi_id" = ? ORDER BY "urls"."id" DESC LIMIT 1  [["doi_id", 1]]