DoiServer/app/views/dois/show.html.erb

SELECT "urls".* FROM "urls" WHERE "urls"."doi_id" = ? ORDER BY "urls"."id" DESC LIMIT 1  [["doi_id", 4]]
---
					<td><%= @doi.name %></td>
					<td><%= @doi.urls.last.url %></td>

SELECT "urls".* FROM "urls" WHERE "urls"."doi_id" = ?  [["doi_id", 1]]
---
			<tbody>
				<% @doi.urls.reverse!.each do |url| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."doi_id" = ?  [["doi_id", 1]]
---
			<tbody>
				<% @doi.reviews.reverse!.each do |review| %>