DoiServer/app/views/dois/udois.html.erb

						<td><%= doi.name %></td>
						<td><%= link_to(doi.urls.last.url,doi.urls.last.url, url_options = {:confirm => 'You will be leaving DOI Server. Continue?'})  %></td>
---
SELECT "urls".* FROM "urls" WHERE "urls"."doi_id" = ? ORDER BY "urls"."id" DESC LIMIT 1  [["doi_id", 1]]