DoiServer/app/controllers/dois_controller.rb

  def index
    @dois = Doi.all
---
SELECT "dois".* FROM "dois"

  def search
	  @dois = Doi.where("name = ?", params[:query])
	  if @dois.count == 0
---
SELECT "dois".* FROM "dois" WHERE (name = NULL)
SELECT COUNT(*) FROM "dois" WHERE (name = 'asdas')

  def udois
    @dois = Doi.find(:all, :conditions => ["user_id = ?", current_user.id])
---
SELECT "dois".* FROM "dois" WHERE "dois"."id" = ? LIMIT 1  [["id", false]]

  def edit
    if current_user.id != @doi.user_id
    	redirect_to root_path, :alert => 'Don\'t be bad. You can\'t do that!'
    else
    	@doi.url = Url.where("doi_id = ?", params[:id]).last.url
---
SELECT "urls".* FROM "urls" WHERE (doi_id = '1') ORDER BY "urls"."id" DESC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1

  def create
    @doi = Doi.new(doi_params)

    if @doi.save
	    @url = Url.new
	    @url.doi_id=@doi.id
	    if params[:doi][:url] =~ /^(https?:\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/
		    @url.url = params[:doi][:url]
		    format.html { render action: 'new' }
	    	    @url.save
---
INSERT INTO "dois" ("created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 28 Oct 2013 04:14:43 UTC +00:00], ["description", "Testing"], ["name", "Name 1"], ["updated_at", Mon, 28 Oct 2013 04:14:43 UTC +00:00], ["user_id", 3]]
INSERT INTO "urls" ("created_at", "doi_id", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Tue, 29 Oct 2013 20:22:36 UTC +00:00], ["doi_id", 19], ["updated_at", Tue, 29 Oct 2013 20:22:36 UTC +00:00], ["url", "HELLO!!!"]]

  def update
    if @doi.urls.last.url != params[:doi][:url]
    	@url = Url.new
    	@url.doi_id = @doi.id

    	if params[:doi][:url] =~ /^(https?:\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/
    		@url.url = params[:doi][:url]
    	else
		redirect_to @doi, alert: 'A full URL is required. Ex: http://www.google.com'
		return
    	end

    	if !@url.save
		redirect_to @doi, alert: 'Failed to update the URL, please try again.'
    	end
    end

    	respond_to do |format|
      	if @doi.update(doi_params)
---
SELECT "urls".* FROM "urls" WHERE "urls"."doi_id" = ? ORDER BY "urls"."id" DESC LIMIT 1  [["doi_id", 4]]
INSERT INTO "urls" ("created_at", "doi_id", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Wed, 30 Oct 2013 21:12:20 UTC +00:00], ["doi_id", 1], ["updated_at", Wed, 30 Oct 2013 21:12:20 UTC +00:00], ["url", "yeah I knowa"]]
UPDATE "dois" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "dois"."id" = 9  [["name", "123"], ["description", "123"], ["updated_at", Tue, 29 Oct 2013 19:50:32 UTC +00:00]]

  def destroy

    if current_user.id != @doi.user_id
	    redirect_to root_path, alert: 'Don\'t be bad! You can\'t do that.'
	    return
    end

    @doi.destroy
---
DELETE FROM "dois" WHERE "dois"."id" = ?  [["id", 1]]

    def set_doi
      @doi = Doi.find(params[:id])
---
SELECT "dois".* FROM "dois" WHERE "dois"."id" = ? LIMIT 1  [["id", "1"]]