DoiServer/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "doi_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "This one sucks!"], ["created_at", Mon, 28 Oct 2013 04:15:14 UTC +00:00], ["doi_id", 1], ["updated_at", Mon, 28 Oct 2013 04:15:14 UTC +00:00], ["user_id", 3]]
---
  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save