DoiServer/app/controllers/urls_controller.rb

  def create
    @url = Url.new(url_params)

    respond_to do |format|
      if @url.save
---
INSERT INTO "urls" ("created_at", "doi_id", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Tue, 29 Oct 2013 18:15:52 UTC +00:00], ["doi_id", 2], ["updated_at", Tue, 29 Oct 2013 18:15:52 UTC +00:00], ["url", "www.youtube.com/nomadmtb"]]

  def update
    respond_to do |format|
      if @url.update(url_params)
---
UPDATE "urls" SET "url" = ?, "updated_at" = ? WHERE "urls"."id" = 1  [["url", "news.com"], ["updated_at", Wed, 30 Oct 2013 20:16:07 UTC +00:00]]

  def destroy
    @url.destroy
---
DELETE FROM "urls" WHERE "urls"."id" = ?  [["id", 12]]

    def set_url
      @url = Url.find(params[:id])
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "12"]]